###  Part # 1
  #### Terraform Format and Style 🖌`success`
  #### Terraform Initialization ⚙️`success`
  #### Terraform Plan 📖`success`
  <details><summary>Show Plan</summary>
  ```

  [command]/home/runner/work/_temp/36eb48f5-3fc6-41c9-b0b4-86bb9b6d60fe/terraform-bin show -no-color tf.plan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_role.sqs-lambda-role-ja2 will be created
  + resource "aws_iam_role" "sqs-lambda-role-ja2" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "sqs-lambda-role-ja2"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "tag-sqs-lambda-role-ja2"
        }
      + tags_all              = {
          + "Name" = "tag-sqs-lambda-role-ja2"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.sqs-lambda-jaimp will be created
  + resource "aws_iam_role_policy_attachment" "sqs-lambda-jaimp" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::928326215142:policy/sqs-lambda-ja"
      + role       = "sqs-lambda-role-ja2"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_iam_role.sqs-lambda-role-ja2 will be created%0A  + resource "aws_iam_role" "sqs-lambda-role-ja2" {%0A      + arn                   = (known after apply)%0A      + assume_role_policy    = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = "sts:AssumeRole"%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + Service = "lambda.amazonaws.com"%0A                        }%0A                      + Sid       = ""%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + create_date           = (known after apply)%0A      + force_detach_policies = false%0A      + id                    = (known after apply)%0A      + managed_policy_arns   = (known after apply)%0A      + max_session_duration  = 3600%0A      + name                  = "sqs-lambda-role-ja2"%0A      + name_prefix           = (known after apply)%0A      + path                  = "/"%0A      + tags                  = {%0A          + "Name" = "tag-sqs-lambda-role-ja2"%0A        }%0A      + tags_all              = {%0A          + "Name" = "tag-sqs-lambda-role-ja2"%0A        }%0A      + unique_id             = (known after apply)%0A    }%0A%0A  # aws_iam_role_policy_attachment.sqs-lambda-jaimp will be created%0A  + resource "aws_iam_role_policy_attachment" "sqs-lambda-jaimp" {%0A      + id         = (known after apply)%0A      + policy_arn = "arn:aws:iam::928326215142:policy/sqs-lambda-ja"%0A      + role       = "sqs-lambda-role-ja2"%0A    }%0A%0APlan: 2 to add, 0 to change, 0 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0

  ```
  </details>
  *Pusher: @jangama3, Action: `pull_request`, Workflow: `Terraform`*